---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetSetIterator
source: html/8235ed4c-7904-94e3-f1ef-7fd84bf422fb.htm
---
# Autodesk.Revit.DB.Visual.AssetSetIterator

## Syntax (C#)
```csharp
public abstract class AssetSetIterator : APIObject,
	IEnumerator
```